[
    {
        "sender": {
            "name": "Harwinder Singh",
            "phoneNumber": "918872351500"
        },
        "messageContent": "Amrit vele da Hukamnama Sri Darbar Sahib, Sri Amritsar, Ang-602, 31-Aug -2025\n\nਸੋਰਠਿ ਮਃ ੩ ਦੁਤੁਕੇ ॥\nਸਤਿਗੁਰ ਮਿਲਿਐ ਉਲਟੀ ਭਈ ਭਾਈ ਜੀਵਤ ਮਰੈ ਤਾ ਬੂਝ ਪਾਇ ॥ ਸੋ ਗੁਰੂ ਸੋ ਸਿਖੁ ਹੈ ਭਾਈ ਜਿਸੁ ਜੋਤੀ ਜੋਤਿ ਮਿਲਾਇ ॥੧॥ ਮਨ ਰੇ ਹਰਿ ਹਰਿ ਸੇਤੀ ਲਿਵ ਲਾਇ ॥ ਮਨ ਹਰਿ ਜਪਿ ਮੀਠਾ ਲਾਗੈ ਭਾਈ ਗੁਰਮੁਖਿ ਪਾਏ ਹਰਿ ਥਾਇ ॥ ਰਹਾਉ ॥ ਬਿਨੁ ਗੁਰ ਪ੍ਰੀਤਿ ਨ ਊਪਜੈ ਭਾਈ ਮਨਮੁਖਿ ਦੂਜੈ ਭਾਇ ॥ ਤੁਹ ਕੁਟਹਿ ਮਨਮੁਖ ਕਰਮ ਕਰਹਿ ਭਾਈ ਪਲੈ ਕਿਛੂ ਨ ਪਾਇ ॥੨॥ ਗੁਰ ਮਿਲਿਐ ਨਾਮੁ ਮਨਿ ਰਵਿਆ ਭਾਈ ਸਾਚੀ ਪ੍ਰੀਤਿ ਪਿਆਰਿ ॥ ਸਦਾ ਹਰਿ ਕੇ ਗੁਣ ਰਵੈ ਭਾਈ ਗੁਰ ਕੈ ਹੇਤਿ ਅਪਾਰਿ ॥੩॥ ਆਇਆ ਸੋ ਪਰਵਾਣੁ ਹੈ ਭਾਈ ਜਿ ਗੁਰ ਸੇਵਾ ਚਿਤੁ ਲਾਇ ॥ ਨਾਨਕ ਨਾਮੁ ਹਰਿ ਪਾਈਐ ਭਾਈ ਗੁਰ ਸਬਦੀ ਮੇਲਾਇ ॥੪॥੮॥\n\nसोरठि मः ३ दुतुके ॥\nसतिगुर मिलिऐ उलटी भई भाई जीवत मरै ता बूझ पाए ॥ सो गुरू सो सिखु है भाई जिसु जोती जोति मिलाए ॥१॥ मन रे हरि हरि सेती लिव लाए ॥ मन हरि जपि मीठा लागै भाई गुरमुखि पाए हरि थाए ॥ रहाउ ॥ बिनु गुर प्रीति न …",
        "messageType": "image",
        "imageUrl": "blob:https://web.whatsapp.com/cd9b351c-6de5-46b8-822f-8a8b99409bf1",
        "timestamp": "6:31 am",
        "group_name": "JHAMKEKHURDGROUP",
        "date": "G1-01-SEPT",
        "processed_time": "2025-09-01T21:26:26.846228",
        "predicted_label": "casual_chat",
        "predicted_sentiment": "Positive"
    },
    {
        "sender": {
            "name": "Harwinder Singh",
            "phoneNumber": "918872351500"
        },
        "messageContent": "Amrit Vele da Hukamnama Sri Darbar Sahib, Sri Amritsar, Ang 671, 01-Sept..-2025\n\nਧਨਾਸਰੀ ਮਹਲਾ ੫ ॥\nਜਿਸ ਕਾ ਤਨੁ ਮਨੁ ਧਨੁ ਸਭੁ ਤਿਸ ਕਾ ਸੋਈ ਸੁਘੜੁ ਸੁਜਾਨੀ ॥ ਤਿਨ ਹੀ ਸੁਣਿਆ ਦੁਖੁ ਸੁਖੁ ਮੇਰਾ ਤਉ ਬਿਧਿ ਨੀਕੀ ਖਟਾਨੀ ॥੧॥ ਜੀਅ ਕੀ ਏਕੈ ਹੀ ਪਹਿ ਮਾਨੀ ॥ ਅਵਰਿ ਜਤਨ ਕਰਿ ਰਹੇ ਬਹੁਤੇਰੇ ਤਿਨ ਤਿਲੁ ਨਹੀ ਕੀਮਤਿ ਜਾਨੀ ॥ ਰਹਾਉ ॥ ਅੰਮ੍ਰਿਤ ਨਾਮੁ ਨਿਰਮੋਲਕੁ ਹੀਰਾ ਗੁਰਿ ਦੀਨੋ ਮੰਤਾਨੀ ॥ ਡਿਗੈ ਨ ਡੋਲੈ ਦ੍ਰਿੜੁ ਕਰਿ ਰਹਿਓ ਪੂਰਨ ਹੋਇ ਤ੍ਰਿਪਤਾਨੀ ॥੨॥ ਓਇ ਜੁ ਬੀਚ ਹਮ ਤੁਮ ਕਛੁ ਹੋਤੇ ਤਿਨ ਕੀ ਬਾਤ ਬਿਲਾਨੀ ॥ ਅਲੰਕਾਰ ਮਿਲਿ ਥੈਲੀ ਹੋਈ ਹੈ ਤਾ ਤੇ ਕਨਿਕ ਵਖਾਨੀ ॥੩॥ ਪ੍ਰਗਟਿਓ ਜੋਤਿ ਸਹਜ ਸੁਖ ਸੋਭਾ ਬਾਜੇ ਅਨਹਤ ਬਾਨੀ ॥ ਕਹੁ ਨਾਨਕ ਨਿਹਚਲ ਘਰੁ ਬਾਧਿਓ ਗੁਰਿ ਕੀਓ ਬੰਧਾਨੀ ॥੪॥੫॥\n\nधनासरी महला ५ ॥जिस का तनु मनु धनु सभु तिस का सोई सुघड़ु सुजानी ॥ तिन ही सुणिआ दुखु सुखु मेरा तउ बिधि नीकी खटानी ॥१॥ जीअ की एकै ही पहि मानी ॥ अवरि जतन करि रहे बहुतेरे तिन तिलु नही कीमति जानी ॥ रहाउ ॥ अम्रित नामु…",
        "messageType": "image",
        "imageUrl": "blob:https://web.whatsapp.com/3ea1d35b-6e13-437a-8ec6-12f55f72e76c",
        "timestamp": "6:23 am",
        "group_name": "JHAMKEKHURDGROUP",
        "date": "G1-01-SEPT",
        "processed_time": "2025-09-01T21:26:26.981988",
        "predicted_label": "casual_chat",
        "predicted_sentiment": "Negative"
    }
]