[
    {
        "sender": {
            "name": "karaj Singh Randhawa",
            "phoneNumber": "919872646162"
        },
        "messageContent": "ਵਾਹਿਗੁਰੂ ਜੀ",
        "messageType": "image",
        "imageUrl": "blob:https://web.whatsapp.com/45336759-67d0-4f97-9174-36b70adc16b1",
        "timestamp": "09:21",
        "group_name": "__2025-08-20 (5)",
        "date": "G1-19-AUG",
        "processed_time": "2025-08-20T10:18:18.308489",
        "predicted_label": "casual_chat",
        "predicted_sentiment": "Positive"
    },
    {
        "sender": {
            "name": "karaj Singh Randhawa",
            "phoneNumber": "919872646162"
        },
        "messageContent": "ਵਾਹਿਗੁਰੂ ਜੀ",
        "messageType": "text",
        "imageUrl": null,
        "timestamp": "09:21",
        "group_name": "__2025-08-20 (5)",
        "date": "G1-19-AUG",
        "processed_time": "2025-08-20T10:18:18.336107",
        "predicted_label": "casual_chat",
        "predicted_sentiment": "Positive"
    },
    {
        "sender": {
            "name": "karaj Singh Randhawa",
            "phoneNumber": "919872646162"
        },
        "messageContent": "ਸਾਖੀ - ਕਾਰੂੰ ਬਾਦਸ਼ਾਹ ਦਾ ਉਧਾਰ \n\nਬਹੁਤ ਪੁਰਾਣੇ ਸਮਿਆਂ ਦੀ ਗੱਲ ਹੈ। ਰੂਮ ਨਾਮ ਦਾ ਇੱਕ ਵੱਡਾ ਦੇਸ਼ ਸੀ। ਉਸ ਦੇਸ਼ ਦਾ ਬਾਦਸ਼ਾਹ ਸੀ — ਕਾਰੂੰ।\nਕਾਰੂੰ ਦੇ ਪਾਸ ਧਨ-ਦੌਲਤ ਦੀ ਕੋਈ ਕਮੀ ਨਹੀਂ ਸੀ। ਸੋਨੇ ਦੇ ਖ਼ਜ਼ਾਨੇ, ਹੀਰੇ-ਜਵਾਹਰਾਤ, ਅਣਗਿਣਤ ਜਾਇਦਾਦਾਂ — ਉਸ ਦੇ ਪਾਸ ਸਭ ਕੁਝ ਸੀ। ਪਰ ਉਸ ਦੇ ਦਿਲ ਵਿੱਚ ਦਇਆ ਨਹੀਂ ਸੀ। ਉਹ ਬਹੁਤ ਜ਼ਿਆਦਾ ਲਾਲਚੀ ਅਤੇ ਜ਼ਾਲਿਮ ਸੀ।\n\nਕਾਰੂੰ ਆਪਣੇ ਲੋਕਾਂ ਉੱਤੇ ਬਹੁਤ ਭਾਰੀ ਟੈਕਸ ਲਾਉਂਦਾ ਸੀ। ਗਰੀਬਾਂ ਤੋਂ ਰੋਟੀ ਵੀ ਖੋਹ ਲੈਂਦਾ ਸੀ। ਕਿਸੇ ਨੂੰ ਦਾਨ ਨਹੀਂ ਦਿੰਦਾ ਸੀ। ਲੋਕਾਂ ਦੇ ਘਰ-ਘਰ ਤੋਂ, ਇੱਥੋਂ ਤੱਕ ਕਿ ਕਬਰਾਂ ਵਿੱਚੋਂ ਵੀ ਸੋਨਾ-ਚਾਂਦੀ ਖੁਦਵਾ ਲੈਂਦਾ ਸੀ। ਜਿਹੜੇ ਲੋਕ ਪਹਿਲਾਂ ਗਰੀਬ ਸਨ, ਉਹ ਉਸ ਦੇ ਜ਼ੁਲਮਾਂ ਕਾਰਨ ਹੋਰ ਵੀ ਦੁੱਖੀ ਹੋ ਗਏ ਸਨ।\n\nਰੂਮ ਦੇ ਲੋਕਾਂ ਦੀ ਜ਼ਿੰਦਗੀ ਬਹੁਤ ਮੁਸ਼ਕਲ ਸੀ। ਸਭ ਦੇ ਚਿਹਰੇ ‘ਤੇ ਡਰ ਸੀ। ਕੋਈ ਵੀ ਕਾਰੂੰ ਦੇ ਅੱਗੇ ਸੱਚ ਬੋਲਣ ਦੀ ਹਿੰਮਤ ਨਹੀਂ ਕਰਦਾ ਸੀ।\n\n🔸ਗੁਰੂ ਨਾਨਕ ਦੇਵ ਜੀ ਦਾ ਰੂਮ ਆਉਣਾ\n\nਇਕ ਦਿਨ, ਸੱਚ ਦਾ ਸੰਦੇਸ਼ਾ ਲੈ ਕੇ ਸ੍ਰੀ ਗੁਰੂ ਨਾਨਕ ਦੇਵ ਜੀ ਆਪਣੇ ਸਾਥੀ ਭਾਈ ਮਰਦਾਨਾ ਜੀ ਸਮੇਤ ਰੂਮ ਦੇਸ਼ ਵਿੱਚ ਆਏ।\nਗੁਰੂ ਜੀ ਨੇ ਲੋਕਾਂ ਦੀ  ਦੁਖੀ ਹਾਲਤ  ਵੇਖੀ । ਉਹ ਜਾਣਦੇ ਸਨ ਕਿ ਇੱਥੇ ਸਿਰਫ਼ ਸੱਚ, ਪਿਆਰ ਅਤੇ ਦਇਆ ਹੀ ਇਸ ਹਨੇਰੇ ਨੂੰ ਦੂਰ ਕਰ ਸਕਦੇ ਹਨ।\n\nਗੁਰੂ ਜੀ ਕਿਲ੍ਹੇ ਦੇ ਦਰਵਾਜ਼ੇ ‘ਤੇ ਜਾ ਕੇ ਰੁਕੇ ਅਤੇ ਦਰਬਾਨਾਂ ਤੋਂ ਪੁੱਛਿਆ:\n\n> \"ਇਸ ਦੇਸ਼ ਦਾ ਬਾਦਸ਼ਾਹ ਕੈਸਾ ਹੈ? ਉਹ ਗਰੀਬਾਂ ਨਾਲ ਕਿਵੇਂ ਵਰਤਾਅ ਕਰਦਾ ਹੈ? ਲੋਕਾਂ ਨਾਲ ਨਿਆਂ ਕਰਦਾ ਹੈ ਜਾਂ ਨਹੀਂ?\"\n\nਦਰਬਾਨਾਂ ਨੇ ਸੱਚ ਬਿਆਨ ਕਰ ਦਿੱਤਾ। ਉਹ ਕਹਿੰਦੇ:\n— \"ਸਾਡਾ ਬਾਦਸ਼ਾਹ ਕਾਰੂੰ ਬਹੁਤ ਜ਼ਾਲਿਮ ਹੈ। ਕਿਸੇ ਨੂੰ ਰਤਾ ਭਰ ਵੀ ਦਾਨ ਨਹੀਂ ਦਿੰਦਾ। ਸਾਰੀ ਪਰਜਾ ਨੂੰ ਲੁੱਟ ਲਿਆ ਹੈ। ਕਬਰਾਂ ਵਿੱਚੋਂ ਵੀ ਸੋਨਾ ਕੱਢ ਲਿਆ। ਲੋਕ ਭੁੱਖੇ ਮਰ ਰਹੇ ਹਨ। ਕਿਸੇ ਨੂੰ ਸੁੱਖ ਨਹੀਂ।\"\nਗੁਰੂ ਜੀ ਨੇ ਫਿਰ ਪੁੱਛਿਆ,\n\"ਇਹ ਧਨ ਇਸ ਨੇ ਕਿਵੇਂ ਇਕੱਠਾ ਕੀਤਾ?\"\n\nਦਰਬਾਨਾਂ ਨੇ ਇੱਕ ਹੈਰਾਨ ਕਰਨ ਵਾਲੀ ਕਹਾਣੀ ਸੁਣਾਈ।\nਇੱਕ ਵਾਰ ਕਾਰੂੰ ਨੇ ਆਪਣੇ ਸਾਰੇ ਵਜ਼ੀਰ ਬੁਲਾਏ ਅਤੇ ਪੁੱਛਿਆ,\n\"ਮੇਰੇ ਰਾਜ ਵਿੱਚ ਹੋਰ ਕਿਤੇ ਚਾਂਦੀ ਦੇ ਸਿੱਕੇ ਬਚੇ ਹਨ?\"\n\nਵਜ਼ੀਰਾਂ ਨੇ ਕਿਹਾ, \"ਹੁਣ ਤਾਂ ਸਾਰਾ ਰਾਜ ਖਾਲੀ ਹੋ ਗਿਆ ਹੈ।\"\nਇਹ ਸੁਣ ਕੇ ਕਾਰੂੰ ਨੇ ਆਪਣੀ ਹੀ ਪੁੱਤਰੀ ਨੂੰ ਬਾਜ਼ਾਰ ਵਿੱਚ ਵੇਚਣ ਲਈ ਖੜਾ ਕਰ ਦਿੱਤਾ — ਮੁੱਲ ਸਿਰਫ਼ ਇੱਕ ਚਾਂਦੀ ਦਾ ਸਿੱਕਾ!\n\nਉਸੇ ਵੇਲੇ ਇੱਕ ਚੌਦਾਂ ਸਾਲ ਦਾ ਲੜਕਾ ਉਥੋਂ ਲੰਘਿਆ। ਰਾਜਕੁਮਾਰੀ ਦੀ ਸੋਭਾ ਵੇਖ ਕੇ ਮੋਹਿਤ ਹੋ ਗਿਆ। ਉਹ ਘਰ ਦੌੜਿਆ ਅਤੇ ਮਾਂ ਨੂੰ ਕਿਹਾ,\n\"ਮੈਨੂੰ ਇੱਕ ਚਾਂਦੀ ਦਾ ਸਿੱਕਾ ਦੇ ਦੇਵੋ, ਮੈਂ ਰਾਜਕੁਮਾਰੀ ਖਰੀਦ ਲਵਾਂਗਾ।\"\n\nਮਾਂ ਨੇ ਦੁੱਖ ਨਾਲ ਕਿਹਾ,\n\"ਪੁੱਤਰ, ਸਾਡੇ ਕੋਲ ਤਾਂ ਇਕ ਵੀ ਸਿੱਕਾ ਨਹੀਂ।\"\n\nਪਰ ਲੜਕਾ ਹੱਠ ਕਰਦਾ ਰਿਹਾ। ਆਖ਼ਿਰ ਮਾਂ ਨੇ ਰੋ ਕੇ ਕਿਹਾ,\n\"ਜਦ ਤੇਰੇ ਪਿਤਾ ਨੂੰ ਦਫਨਾਇਆ ਸੀ, ਉਸ ਦੇ ਮੂੰਹ ਵਿੱਚ ਇੱਕ ਸਿੱਕਾ ਰੱਖਿਆ ਸੀ। ਜੇ ਚਾਹੁੰਦਾ ਹੈਂ, ਉਹ ਕੱਢ ਲੈ।\"\n\nਲੜਕਾ ਦੌੜਿਆ, ਪਿਤਾ ਦੀ ਕਬਰ ਖੋਦ ਕੇ ਸਿੱਕਾ ਕੱਢਿਆ ਅਤੇ ਬਾਜ਼ਾਰ ਪਹੁੰਚ ਗਿਆ। ਇਹ ਸੁਣ ਕੇ ਕਾਰੂੰ ਸ਼ੱਕੀ ਹੋਇਆ, ਉਸ ਨੂੰ ਫੜ ਕੇ ਬੇਰਹਮੀ ਨਾਲ ਮਾਰਿਆ ਅਤੇ ਪੁੱਛਿਆ, \"ਸਿੱਕਾ ਕਿੱਥੋਂ ਲਿਆ?\"\nਲੜਕੇ ਨੇ ਸੱਚ ਦੱਸ ਦਿੱਤਾ।\n\nਤੁਰੰਤ ਕਾਰੂੰ ਨੇ ਹੁਕਮ ਦਿੱਤਾ — ਸਾਰੇ ਰਾਜ ਦੀਆਂ ਕਬਰਾਂ ਖੋਦੋ! ਕਈ ਕਬਰਾਂ ਵਿਚੋਂ ਸਿੱਕੇ ਮਿਲੇ। ਲੋਕਾਂ ਨੇ ਕਿਹਾ, \"ਇਹ ਤਾਂ ਸਭ ਤੋਂ ਵੱਡਾ ਜ਼ੁਲਮ ਹੈ!\"\n\nਗੁਰੂ ਜੀ ਨੇ ਇਹ ਸੁਣ ਕੇ ਕਿਹਾ,\n\"ਇਹ ਧਨ ਦੇ ਨਾਲ ਨਰਕ ਵਿਚ ਜਾਵੇਗਾ। ਇਹਦਾ ਜੀਵਨ ਧ੍ਰਿਗ ਹੈ।\"\n\nਗੁਰੂ ਜੀ ਨੇ ਦਰਬਾਨਾਂ ਨੂੰ ਕਿਹਾ,\n\"ਕਾਰੂੰ ਨੂੰ ਕਹੋ ਕਿ ਇੱਕ ਫਕੀਰ ਆਇਆ ਹੈ, ਜੋ ਕੁਝ ਨਹੀਂ ਮੰਗਦਾ, ਸਿਰਫ਼ ਮਿਲਣਾ ਚਾਹੁੰਦਾ ਹੈ।\"\n          \n           🔸ਕਾਰੂੰ ਨਾਲ ਮੁਲਾਕਾਤ🔸\n\nਦਰਬਾਨਾਂ ਨੇ ਕਾਰੂੰ ਨੂੰ ਜਾ ਕੇ ਦੱਸਿਆ ਕਿ ਇੱਕ ਫਕੀਰ ਦਰਬਾਰ ਦੇ ਬਾਹਰ ਆਇਆ ਹੈ।\nਕਾਰੂੰ ਨੇ ਹੁਕਮ ਦਿੱਤਾ ਕਿ ਉਸ ਨੂੰ ਅੰਦਰ ਲਿਆਂਦਾ ਜਾਵੇ।\n\nਜਦ ਕਾਰੂੰ ਬਾਹਰ ਆਇਆ, ਉਸ ਨੇ ਵੇਖਿਆ ਕਿ ਗੁਰੂ ਜੀ ਕੱਚੀਆਂ ਮਿੱਟੀ ਦੀਆਂ ਠੀਕਰੀਆਂ ਚੁਣ ਚੁਣ ਕੇ ਆਪਣੇ ਕੱਪੜੇ ਵਿੱਚ ਪਾ ਰਹੇ ਹਨ। \nਹੈਰਾਨ ਹੋ ਕੇ ਕਾਰੂੰ ਨੇ ਪੁੱਛਿਆ:\n\n> \"ਤੁਸੀਂ ਇਹ ਠੀਕਰੀਆਂ ਕਿਉਂ ਚੁਣ ਰਹੇ ਹੋ? ਇਹਨਾਂ ਦਾ ਕੀ ਕਰੋਗੇ?\"\nਗੁਰੂ ਜੀ ਨੇ ਸ਼ਾਂਤ ਸੁਰ ਵਿੱਚ ਕਿਹਾ:\n\n> \"ਇਹ ਠੀਕਰੀਆਂ ਮੇਰੇ ਨਾਲ ਪਰਲੋਕ ਵਿੱਚ ਜਾਣਗੀਆਂ। ਇਸ ਲਈ ਮੈਂ ਇਨ੍ਹਾਂ ਨੂੰ ਚੁਣ ਰਿਹਾ ਹਾਂ। ਇਹ ਪਰਲੋਕ ਵਿੱਚ ਮੇਰੇ ਕੰਮ ਆਉਣਗੀਆਂ।\"\n\n  ਕਾਰੂੰ ਹੱਸ ਕੇ ਬੋਲਾ:\n\n> \"ਹੇ ਦਰਵੇਸ਼! ਇਹ ਠੀਕਰੀਆਂ ਕਿਵੇਂ ਤੇਰੇ ਨਾਲ ਜਾਣਗੀਆਂ? ਮਨੁੱਖ ਦਾ ਸਰੀਰ ਤਾਂ ਇੱਥੇ ਹੀ ਰਹਿ ਜਾਂਦਾ ਹੈ। ਨਾਲ ਇਕ ਤੀਲੇ ਜਿੰਨੀ ਵੀ ਚੀਜ਼ ਨਹੀਂ ਜਾਂਦੀ।\n\nਗੁਰੂ ਜੀ ਨੇ ਕਾਰੂੰ ਦੀਆਂ ਅੱਖਾਂ ਵਿੱਚ ਅੱਖਾਂ ਪਾ ਕੇ ਕਿਹਾ:\n\n> \"ਤੂੰ ਦੇਸ਼ ‘ਤੇ ਜ਼ੁਲਮ ਕਰਕੇ ਪੰਜਤਾਲੀ ਖ਼ਜ਼ਾਨੇ ਇਕੱਠੇ ਕੀਤੇ ਹਨ। ਇਹ ਕਿਵੇਂ ਤੇਰੇ ਨਾਲ ਜਾਣਗੇ? ਜਿਹੜੇ ਪਾਪ ਕਰਕੇ ਇਕੱਠੇ ਕੀਤੇ ਗਏ ਹਨ, ਉਹ ਸਿਰਫ਼ ਤੇਰੇ ਲਈ ਦੁੱਖ ਅਤੇ ਬਰਬਾਦੀ ਹੀ ਲਿਆਣਗੇ।\"\n\nਗੁਰੂ ਜੀ ਨੇ ਉਸ ਨੂੰ ਉਸ ਦੇ ਮਰੇ ਭਰਾ ਦੀ ਮਿਸਾਲ ਦਿੱਤੀ — ਕਿ ਜਿਵੇਂ ਉਸ ਦਾ ਸਰੀਰ, ਧਨ-ਦੌਲਤ ਇੱਥੇ ਹੀ ਰਹਿ ਗਏ, ਸਿਰਫ਼ ਕਰਮ ਨਾਲ ਗਏ।\n\n> \"ਮਾਇਆ ਦਾ ਮੋਹ ਮਨੁੱਖ ਨੂੰ ਅੰਨ੍ਹਾ ਕਰ ਦਿੰਦਾ ਹੈ। ਪਰ ਪਰਲੋਕ ਵਿੱਚ ਸਿਰਫ਼ ਚੰਗੇ ਕਰਮ ਅਤੇ ਨਾਮ ਸਿਮਰਨ ਹੀ ਤੇਰੇ ਨਾਲ ਜਾਂਦੇ ਹਨ।\"\n    🔸 ਕਾਰੂੰ ਦਾ ਦਿਲ ਬਦਲਣਾ\n\nਇਹ ਬਚਨ ਸੁਣ ਕੇ ਕਾਰੂੰ ਦੇ ਪੱਥਰ ਦਿਲ  ਵਿੱਚ ਦਰਾਰ ਪੈ ਗਈ।\nਉਹ ਹੌਲੀ ਆਵਾਜ਼ ਵਿੱਚ ਬੋਲਿਆ:\n\n> \"ਜੋ ਕੁਝ ਮੈਂ ਕੀਤਾ, ਉਸ ‘ਤੇ ਮੈਨੂੰ ਪਛਤਾਵਾ ਹੈ। ਹੁਣ ਮੈਨੂੰ ਸਹੀ ਰਾਹ ਦਿਖਾਓ। ਮੈਂ ਕਿਵੇਂ ਖੁਦਾ ਨੂੰ ਯਾਦ ਕਰਾਂ? ਮੈਂ ਮਾਇਆ ਵਿੱਚ ਫਸਿਆ ਰਿਹਾ ਹਾਂ।\"\n\nਗੁਰੂ ਜੀ ਨੇ ਕਿਹਾ:\n\n> \"ਦੁਨੀਆਂ ਦੇ ਸਾਰੇ ਰਿਸ਼ਤੇ ਖਾਣ-ਪੀਣ ਤੱਕ ਹੀ ਰਹਿੰਦੇ ਹਨ। ਧਨ ਦਾ ਮਿੱਤਰ ਦੁੱਖ ਵੇਲੇ ਕੰਮ ਨਹੀਂ ਆਉਂਦਾ। ਪਰ ਰੱਬ ਦਾ ਨਾਮ — ਇਹੀ ਹੈ ਜੋ ਅੰਤ ਵੇਲੇ ਤੈਨੂੰ ਬਚਾ ਸਕਦਾ ਹੈ।\"\n       🔸 ਰੂਮ ਵਿੱਚ ਸੁੱਖ ਦੀ ਵਾਪਸੀ\n\nਕਾਰੂੰ ਨੇ ਤੁਰੰਤ ਗੁਰੂ ਜੀ ਦੀਆਂ ਗੱਲਾਂ ਮੰਨ ਲਈਆਂ। ਉਸ ਨੇ ਹੁਕਮ ਜਾਰੀ ਕੀਤਾ:\n— ਸਾਰੇ ਕੈਦੀ ਰਿਹਾਅ ਕੀਤੇ ਜਾਣ।\n— ਲੋਕਾਂ ਤੋਂ ਲੁੱਟਿਆ ਧਨ ਵਾਪਸ ਕੀਤਾ ਜਾਵੇ।\n— ਗਰੀਬਾਂ ਲਈ ਲੰਗਰ ਲਗਾਏ ਜਾਣ।\n— ਜ਼ੁਲਮ ਖਤਮ ਕੀਤਾ ਜਾਵੇ।\n\nਕੁਝ ਹੀ ਦਿਨਾਂ ਵਿੱਚ ਰੂਮ ਦੇ ਲੋਕਾਂ ਦੇ ਚਿਹਰਿਆਂ ‘ਤੇ ਮੁਸਕਾਨ ਵਾਪਸ ਆ ਗਈ। ਲੋਕ ਖੁਸ਼ ਹੋ ਗਏ। ਘਰਾਂ ਵਿੱਚ ਅਮਨ-ਸੁੱਖ ਆ ਗਿਆ।\n         🔸ਗੁਰੂ ਜੀ ਦਾ ਵਿਦਾ ਹੋਣਾ\n\nਜਦ ਗੁਰੂ ਜੀ ਅੱਗੇ ਜਾਣ ਲੱਗੇ, ਕਾਰੂੰ ਨੇ ਹੱਥ ਜੋੜ ਕੇ ਬੇਨਤੀ ਕੀਤੀ:\n\n> \"ਮੇਰੇ ਪਾਸ ਰਹੋ ਜੀ। ਜੇ ਰਹਿਣਾ ਨਹੀਂ ਤਾਂ ਫਿਰ ਕਦ ਆ ਕੇ ਮਿਲੋਗੇ?\"\nਗੁਰੂ ਜੀ ਨੇ ਪਿਆਰ ਨਾਲ ਕਿਹਾ:\n\n> \"ਨਾਮ ਦਾ ਸਿਮਰਨ ਕਰ। ਆਪਣੇ ਅੰਦਰ ਧਿਆਨ ਧਾਰਨ ਕਰ। ਇਹੀ ਸਾਡਾ ਮਿਲਾਪ ਹੈ।\"\n\nਇਹ ਕਹਿ ਕੇ ਗੁਰੂ ਜੀ ਅੱਗੇ ਵਧ ਗਏ।\nਕਾਰੂੰ ਦਾ ਦਿਲ ਹੁਣ ਮਾਇਆ ਦੇ ਹਨੇਰੇ ਤੋਂ ਮੁਕਤ ਸੀ। ਉਸ ਨੇ ਆਪਣੀ ਬਾਕੀ ਜ਼ਿੰਦਗੀ ਲੋਕਾਂ ਦੀ ਸੇਵਾ ਅਤੇ ਰੱਬ ਦੇ ਨਾਮ ਸਿਮਰਨ ਵਿੱਚ ਬਿਤਾਈ।\n             🔸ਰੂਹਾਨੀ ਸਿੱਖਿਆ\nਕਾਰੂੰ ਪ੍ਰਸੰਗ ਸਾਨੂੰ ਸਿੱਖਾਉਂਦਾ ਹੈ ਕਿ —\n\n🔸1. ਧਨ ਸਾਡੇ ਨਾਲ ਨਹੀਂ ਜਾਂਦਾ – ਚਾਹੇ ਕਿੰਨਾ ਵੀ ਇਕੱਠਾ ਕਰ ਲਵੋ, ਅੰਤ ਵਿੱਚ ਸਿਰਫ਼ ਕਰਮ ਹੀ ਸਾਡੇ ਨਾਲ ਹੁੰਦੇ ਹਨ।\n🔸2. ਜ਼ੁਲਮ ਦੇ ਨਾਲ ਕਮਾਇਆ ਹੋਇਆ ਧਨ ਬਰਬਾਦੀ ਲਿਆਉਂਦਾ ਹੈ – ਉਹ ਮਨੁੱਖ ਨੂੰ ਅੰਦਰੋਂ ਸਾੜ ਦਿੰਦਾ ਹੈ।\n🔸3. ਗੁਰੂ ਦੀ ਸੰਗਤ ਮਨੁੱਖ ਨੂੰ ਬਦਲ ਸਕਦੀ ਹੈ –  ਗੁਰੂ ਦੀ ਸੰਗਤ ਵਿੱਚ ਪੱਥਰ ਵਰਗਾ ਦਿਲ ਵੀ ਮੋਮ ਬਣ ਸਕਦਾ ਹੈ।\n🔸4. ਨਾਮ ਅਤੇ ਸੇਵਾ ਹੀ ਅਸਲੀ ਖ਼ਜ਼ਾਨਾ ਹੈ – ਇਹੀ ਪਰਲੋਕ ਵਿੱਚ ਸਾਡਾ ਸਾਥ ਦਿੰਦਾ ਹੈ।\nਨੋਟ -ਇਸ ਸਾਖੀ ਦਾ ਜਿਕਰ ਭਾਈ ਸੰਤੋਖ ਜੀ ਵੱਲੋਂ ਰਚਿਤ ਗੁਰੂ ਨਾਨਕ ਪ੍ਰਕਾਸ਼ ਗ੍ਰੰਥ ਵਿੱਚ ਕੀਤਾ ਗਿਆ\n         🔸ਭੁੱਲ ਚੁੱਕ ਦੀ ਖਿਮਾ 🔸\nਜੇ ਇਹ ਲਿਖਤ ਚੰਗੀ ਲੱਗੇ ਤਾਂ ਇਸ ਪੇਜ \n        f@Suche Moti ਸੁੱਚੇ ਮੋਤੀ \nਨੂੰ ਜਰੂਰ ਲਾਇਕ ,ਸ਼ੇਅਰ ਅਤੇ ਕਮੈਂਟ ਕਰਨਾ। ਇਹ ਸਾਖੀ ਆਪਣੇ Whasapp ਗਰੁੱਪਾਂ, ਸਾਕ ਸਬੰਧੀਆਂ ਅਤੇ ਰਿਸ਼ਤੇਦਾਰਾਂ ਨਾਲ ਜਰੂਰ ਸਾਂਝੀ ਕਰਨਾ।",
        "messageType": "image",
        "imageUrl": "blob:https://web.whatsapp.com/3fb6239d-e41d-404d-8d9e-8f1d32cfca34",
        "timestamp": "09:21",
        "group_name": "__2025-08-20 (5)",
        "date": "G1-19-AUG",
        "processed_time": "2025-08-20T10:18:18.401913",
        "predicted_label": "politics_news",
        "predicted_sentiment": "Negative"
    },
    {
        "sender": {
            "name": "rubisingh70@gmail.com",
            "phoneNumber": "919914594263"
        },
        "messageContent": "ਵਾਹਿਗੁਰੂ ਜੀ",
        "messageType": "text",
        "imageUrl": null,
        "timestamp": "09:21",
        "group_name": "__2025-08-20 (5)",
        "date": "G1-19-AUG",
        "processed_time": "2025-08-20T10:18:18.417564",
        "predicted_label": "casual_chat",
        "predicted_sentiment": "Positive"
    },
    {
        "sender": {
            "name": "ਵਾਹਿਗੁਰੂ ਜੀ",
            "phoneNumber": "919781132002"
        },
        "messageContent": "ਵਾਹਿਗੁਰੂ ਜੀ",
        "messageType": "text",
        "imageUrl": null,
        "timestamp": "09:21",
        "group_name": "__2025-08-20 (5)",
        "date": "G1-19-AUG",
        "processed_time": "2025-08-20T10:18:18.433197",
        "predicted_label": "casual_chat",
        "predicted_sentiment": "Positive"
    },
    {
        "sender": {
            "name": "karaj Singh Randhawa",
            "phoneNumber": "919872646162"
        },
        "messageContent": "ਵਾਹਿਗੁਰੂ ਜੀ",
        "messageType": "image",
        "imageUrl": "blob:https://web.whatsapp.com/01e7196e-5f28-4b21-b8e7-5bde8874ff83",
        "timestamp": "2025-08-20T03:51:05.301Z",
        "group_name": "__2025-08-20 (5)",
        "date": "G1-19-AUG",
        "processed_time": "2025-08-20T10:18:18.448872",
        "predicted_label": "casual_chat",
        "predicted_sentiment": "Positive"
    },
    {
        "sender": {
            "name": "karaj Singh Randhawa",
            "phoneNumber": "919872646162"
        },
        "messageContent": "ਵਾਹਿਗੁਰੂ ਜੀ",
        "messageType": "text",
        "imageUrl": null,
        "timestamp": "09:21",
        "group_name": "__2025-08-20 (5)",
        "date": "G1-19-AUG",
        "processed_time": "2025-08-20T10:18:18.480218",
        "predicted_label": "casual_chat",
        "predicted_sentiment": "Positive"
    },
    {
        "sender": {
            "name": "karaj Singh Randhawa",
            "phoneNumber": "919872646162"
        },
        "messageContent": "ਵਾਹਿਗੁਰੂ ਜੀ",
        "messageType": "text",
        "imageUrl": null,
        "timestamp": "2025-08-20T03:51:06.538Z",
        "group_name": "__2025-08-20 (5)",
        "date": "G1-19-AUG",
        "processed_time": "2025-08-20T10:18:18.495881",
        "predicted_label": "casual_chat",
        "predicted_sentiment": "Positive"
    }
]