[
    {
        "sender": {
            "name": "Nardip Singh",
            "phoneNumber": "919872615910"
        },
        "messageContent": "ਸਿੱਖ ਇਤਿਹਾਸ ਮਿਟਾਉਣ ਦੀ ਸਾਜਿਸ਼ ?\nਪੰਜਾਬੀ ਯੂਨੀਵਰਸਿਟੀ ਦੀ ਕਾਲੀ ਕਰਤੂਤ 😠\nਆਖ਼ਿਰ ਪਰਦੇ ਪਿੱਛੇ ਕੌਣ ??????????\nਅੱਜ ਆਪਣੇ ਆਪ ਨੂੰ ਪੰਜਾਬੀ ਦਾ ਝੰਡਾਬਰਦਾਰ ਆਖ ਲੋਕਾਂ ਦੀਆਂ ਅੱਖਾਂ ਵਿੱਚ ਘੱਟਾ ਫੱਕਣ ਦੀ ਸਾਜਿਸ਼ ਦਾ ਅਸਲ ਚਿਹਰਾ ਸਾਹਮਣੇ ਆਇਆ ਜਿੱਥੇ ਪੰਜਾਬੀ ਯੂਨੀਵਰਸਿਟੀ ਦੇ ਕੈਂਪਸ ਅੰਦਰ 10 10 ਫੁੱਟ ਡੂੰਘੇ ਟੋਏ ਪੁੱਟ ਸਿੱਖ ਕੌਮ ਦਾ ਸਰਮਾਇਆ ਅਤੇ ਭਾਈ ਕਾਹਨ ਸਿੰਘ ਨਾਭਾ ਦੀ ਖੋਜ ਭਰੀ ਕਹਾਣੀ ਮਹਾਨ ਕੋਸ਼ ਅਤੇ ਕਈ ਹੋਰ ਸਿੱਖ ਇਤਿਹਾਸ ਅਤੇ ਗੁਰਬਾਣੀ ਨਾਲ ਸਬੰਧਿਤ ਕਿਤਾਬਾਂ ਨੂੰ ਇਹਨਾਂ ਟੋਇਆ ਵਿੱਚ ਸੁੱਟ ਪਾਣੀ ਛੱਡ ਇਹਨਾਂ ਨੂੰ ਖ਼ਤਮ ਕਰਨ ਦੀ ਕਾਲੀ ਕਰਤੂਤ ਸਾਹਮਣੇ ਆਈ ਹੈ ਸਿੱਖ ਕੌਮ ਦਾ ਇਹ ਸਰਮਾਇਆ ਇਸ ਤਰ੍ਹਾਂ ਜ਼ਮੀਨਦੋਜ਼ ਕਰਨਾ ਜਿਸ ਵਿੱਚ ਕਈ ਪੁਸਤਕਾਂ ਵਿੱਚ ਗੁਰਬਾਣੀ ਵੀ ਦਰਜ ਹੈ ਅਤੇ ਭਗਵਤ ਗੀਤਾ ਵੀ ਕ਼ੀ ਇਹ ਬੇਅਦਬੀ ਨਹੀਂ ਹੈ ਕੀ ਪੰਜਾਬੀ ਯੂਨੀਵਰਸਿਟੀ ਦੇ ਵੀ ਸੀ ਉਤੇ ਮਾਮਲਾ ਦਰਜ ਨਹੀਂ ਹੋਣਾ ਚਾਹੀਦਾ ਇਸ ਵੀ ਸੀ ਦੀ ਤੈਨਾਤੀ ਨੂੰ ਲੈ ਕੇ ਲੋਕਾਂ ਖੁਸ਼ੀ ਮਨਾਈ ਸੀ ਪਰ ਇਹਨਾਂ ਕਿਵੇ ਇੱਕ ਸਿੱਖ ਹੁੰਦੇ ਸਿੱਖ ਕੌਮ ਦੇ ਸਰਮਾਏ ਦਾ ਘਾਣ ਕੀਤਾ ਆਖ਼ਿਰ ਕੌਣ ਹੈ ਇਸ ਐਡੀ ਵੱਡੀ ਸਾਜਿਸ਼ ਪਿੱਛੇ ਕ਼ੀ ਮੰਤਵ ਸੀ ਇਸ ਕਾਲੀ ਕਰਤੂਤ ਦਾ ਜਿਹਨ੍ਹੇ ਇੱਕ ਵਾਰ ਫੇਰ ਸਿੱਖ ਕੌਮ ਦੇ ਹਿਰਦੇ ਵਲੂੰਧਰੇ ਜੇ ਕੀਤੇ ਕੁਝ ਵਿਦਿਆਰਥੀਆਂ ਵਲੋਂ ਇਸ ਪਾਸੇ ਧਿਆਨ ਨਾ ਦਿੱਤਾ ਹੁੰਦਾ ਤਾਂ ਇਹਨਾਂ ਦੀ ਇਹ ਸਾਜਿਸ਼ ਬੜੇ ਹੀ ਅਰਾਮ ਨਾਲ ਨੇਪਰੇ ਚੜ ਜਾਣੀ ਸੀ ਪਰ ਗੁਰੂ ਦੇ ਮੁੱਖ ਵਿੱਚੋ ਉਚਰੀ ਬਾਣੀ ਨੂੰ ਐਡਾ ਸੌਖਾ ਵੀ ਖਪਾਇਆ ਨਹੀ ਜਾ ਸਕਦਾ ਲੱਖ ਲਾਹਨਤ ਹੈ ਅਜਿਹੇ ਅਦਾਰੇ ਨੂੰ ਜਿਹਨਾਂ ਸਾਰੀ ਉਮਰ ਪੰਜਾਬੀ ਅਤੇ ਸਿੱਖ ਕੌਮ ਦੇ ਨਾਂ ਤੇ ਰੋਟੀਆਂ ਸੇਕੀਆਂ ਅਤੇ ਘਰ ਦੇ ਚੁੱਲ੍ਹੇ ਬਾਲੇ ਅਤੇ ਬਾਲ ਨਿਆਣੇ ਪਾਲੇ ਆਖ਼ਿਰ ਅਜਿਹੀ ਕਿਹੜੀ ਧੋਣ ਤੇ ਤਲਵਾਰ ਰੱਖੀ ਗਈ ਸੀ ਜੋ ਸਿੱਖ ਕੌਮ ਨਾਲ ਹੀ ਐਡੀ ਗਦਾਰੀ ਕਮਾ ਲਈ ਸ਼ਰਮਨਾਕ ਤਸਵੀਰ 😓 ਹਰ ਪੰਜਾਬੀ ਅਤੇ ਪੰਜਾਬ ਦੇ ਇਤਿਹਾਸ ਅਤੇ ਸਿੱਖ ਇਤਿਹਾਸ ਅਤੇ ਸਾਡੇ ਸਿੱਖ ਸਰਮਾਏ ਨੂੰ ਪਿਆਰ ਕਰਨ ਵਾਲਿਆਂ ਨੂੰ ਇਸਦਾ ਜਵਾਬ ਮੰਗਣਾ ਚਾਹੀਦਾ ਸਰਕਾਰ ਕੋਲੋਂ ਵੀ ਪੰਜਾਬੀ ਯੂਨੀਵਰਸਿਟੀ ਕੋਲੋ ਵੀ ਅਤੇ ਇਸ ਗੰਭੀਰ ਮਾਮਲੇ ਦੀ ਨਿਰਪੱਖ ਜੁਡੀਸ਼ੀਅਲ ਜਾਂਚ ਹੋਣੀ ਚਾਹੀਦੀ ਅਤੇ ਦੋਸ਼ੀਆਂ ਨੂੰ ਸਖ਼ਤ ਸਜ਼ਾਵਾਂ ਅਤੇ ਨੌਕਰੀਆਂ ਤੋਂ ਲਾਂਭੇ ਕੀਤਾ ਜਾਣਾ ਚਾਹੀਦਾ ਖ਼ਾਸ ਕਰ ਵਾਇਸ ਚਾਂਸਲਰ .\n#sikhhistory #punjabiuniversitypatiala #punjab",
        "messageType": "image",
        "imageUrl": "blob:https://web.whatsapp.com/20ccaa6b-6ed4-46e6-912b-2aa8e2c54323",
        "timestamp": "7:14 am",
        "group_name": "Aap_jhabal_pukhta (2)",
        "date": "G1-30-AUG",
        "processed_time": "2025-08-30T18:22:31.890033",
        "predicted_label": "entertainment_news",
        "predicted_sentiment": "Negative"
    },
    {
        "sender": {
            "name": "ਸਤਿ ਸ੍ਰੀ ਅਕਾਲ",
            "phoneNumber": "918054613521"
        },
        "messageContent": "ਸਿੱਖ ਇਤਿਹਾਸ ਮਿਟਾਉਣ ਦੀ ਸਾਜਿਸ਼ ?\nਪੰਜਾਬੀ ਯੂਨੀਵਰਸਿਟੀ ਦੀ ਕਾਲੀ ਕਰਤੂਤ \nਆਖ਼ਿਰ ਪਰਦੇ ਪਿੱਛੇ ਕੌਣ ??????????\nਅੱਜ ਆਪਣੇ ਆਪ ਨੂੰ ਪੰਜਾਬੀ ਦਾ ਝੰਡਾਬਰਦਾਰ ਆਖ ਲੋਕਾਂ ਦੀਆਂ ਅੱਖਾਂ ਵਿੱਚ ਘੱਟਾ ਫੱਕਣ ਦੀ ਸਾਜਿਸ਼ ਦਾ ਅਸਲ ਚਿਹਰਾ ਸਾਹਮਣੇ ਆਇਆ ਜਿੱਥੇ ਪੰਜਾਬੀ ਯੂਨੀਵਰਸਿਟੀ ਦੇ ਕੈਂਪਸ ਅੰਦਰ 10 10 ਫੁੱਟ ਡੂੰਘੇ ਟੋਏ ਪੁੱਟ ਸਿੱਖ ਕੌਮ ਦਾ ਸਰਮਾਇਆ ਅਤੇ ਭਾਈ ਕਾਹਨ ਸਿੰਘ ਨਾਭਾ ਦੀ ਖੋਜ ਭਰੀ ਕਹਾਣੀ ਮਹਾਨ ਕੋਸ਼ ਅਤੇ ਕਈ ਹੋਰ ਸਿੱਖ ਇਤਿਹਾਸ ਅਤੇ ਗੁਰਬਾਣੀ ਨਾਲ ਸਬੰਧਿਤ ਕਿਤਾਬਾਂ ਨੂੰ ਇਹਨਾਂ ਟੋਇਆ ਵਿੱਚ ਸੁੱਟ ਪਾਣੀ ਛੱਡ ਇਹਨਾਂ ਨੂੰ ਖ਼ਤਮ ਕਰਨ ਦੀ ਕਾਲੀ ਕਰਤੂਤ ਸਾਹਮਣੇ ਆਈ ਹੈ ਸਿੱਖ ਕੌਮ ਦਾ ਇਹ ਸਰਮਾਇਆ ਇਸ ਤਰ੍ਹਾਂ ਜ਼ਮੀਨਦੋਜ਼ ਕਰਨਾ ਜਿਸ ਵਿੱਚ ਕਈ ਪੁਸਤਕਾਂ ਵਿੱਚ ਗੁਰਬਾਣੀ ਵੀ ਦਰਜ ਹੈ ਅਤੇ ਭਗਵਤ ਗੀਤਾ ਵੀ ਕ਼ੀ ਇਹ ਬੇਅਦਬੀ ਨਹੀਂ ਹੈ ਕੀ ਪੰਜਾਬੀ ਯੂਨੀਵਰਸਿਟੀ ਦੇ ਵੀ ਸੀ ਉਤੇ ਮਾਮਲਾ ਦਰਜ ਨਹੀਂ ਹੋਣਾ ਚਾਹੀਦਾ ਇਸ ਵੀ ਸੀ ਦੀ ਤੈਨਾਤੀ ਨੂੰ ਲੈ ਕੇ ਲੋਕਾਂ ਖੁਸ਼ੀ ਮਨਾਈ ਸੀ ਪਰ ਇਹਨਾਂ ਕਿਵੇ ਇੱਕ ਸਿੱਖ ਹੁੰਦੇ ਸਿੱਖ ਕੌਮ ਦੇ ਸਰਮਾਏ ਦਾ ਘਾਣ ਕੀਤਾ ਆਖ਼ਿਰ ਕੌਣ…",
        "messageType": "image",
        "imageUrl": "blob:https://web.whatsapp.com/08f0ddfb-3599-4f2d-b9b0-8aca03853d01",
        "timestamp": "9:59 am",
        "group_name": "Aap_jhabal_pukhta (2)",
        "date": "G1-30-AUG",
        "processed_time": "2025-08-30T18:22:31.940874",
        "predicted_label": "entertainment_news",
        "predicted_sentiment": "Negative"
    },
    {
        "sender": {
            "name": "ਸਤਿ ਸ੍ਰੀ ਅਕਾਲ",
            "phoneNumber": "918054613521"
        },
        "messageContent": "National Herald  ਮਾਮਲੇ ਵਿੱਚ ਅੱਜ ਤੱਕ ਗਾਂਧੀ ਪਰਿਵਾਰ ਦਾ ਕੋਈ ਵੀ ਵਿਅਕਤੀ ਜੇਲ੍ਹ ਨਹੀਂ ਗਿਆ। 2014 ਦੀ ਵਿਧਾਨ ਸਭਾ ਚੋਣ ਜੀਜਾ ਜੀ ਦੇ ਨਾਂ 'ਤੇ ਲੜੀ ਅਤੇ ਜਿੱਤੀ। ਪਰ ਉਸ 'ਤੇ ਵੀ ਕੁਝ ਨਹੀਂ ਕੀਤਾ ਗਿਆ।\n\nਅੱਜਕੱਲ੍ਹ ਤਾਂ ਲੋਕ ਕਹਿ ਰਹੇ ਹਨ ਕਿ ਕਾਂਗਰਸ ਨੇ Compromise ਕਰ ਰੱਖਿਆ ਹੈ। ਆਮ ਆਦਮੀ ਪਾਰਟੀ Compromise ਦੀ ਰਾਜਨੀਤੀ ਨਹੀਂ ਕਰਦੀ ਹੈ।",
        "messageType": "text",
        "imageUrl": null,
        "timestamp": "5:50 pm",
        "group_name": "Aap_jhabal_pukhta (2)",
        "date": "G1-30-AUG",
        "processed_time": "2025-08-30T18:22:31.987684",
        "predicted_label": "politics_news",
        "predicted_sentiment": "Negative"
    },
    {
        "sender": {
            "name": "Harjeet Singh",
            "phoneNumber": "919914585881"
        },
        "messageContent": "https://www.facebook.com/share/v/1FwsEuQfGr/",
        "messageType": "text",
        "imageUrl": null,
        "timestamp": "9:35 am"
    }
]